tap "akamai-developers/tap"
tap "nikitabobko/tap"
tap "spinframework/tap"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Command-line fuzzy finder written in Go
brew "fzf"
# Audit git repos for secrets
brew "gitleaks"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# HTTP load generator, inspired by rakyll/hey with tui animation
brew "oha"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Open-source tool for building and running serverless WebAssembly applications
brew "spinframework/tap/spin"
# A MCP Server for Akamai Functions
brew "akamai-developers/tap/akamai-functions-mcp"
# AeroSpace is an i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace"
# App to build and share containerised applications and microservices
cask "docker-desktop"
cask "font-jetbrains-mono"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Control your tools with a few keystrokes
cask "raycast"
# Screen recording and video editing software
cask "screenflow"
# Open-source code editor
cask "visual-studio-code"
# Multiplayer code editor
cask "zed"
